Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/katafc/nginx/target_count_21/repeat_33/7.txt
2020/01/22 15:05:21 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8007/
2020/01/22 15:05:51 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 10411 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8007
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      10411
Failed requests:        0
Total transferred:      8797295 bytes
HTML transferred:       6371532 bytes
Requests per second:    347.01 [#/sec] (mean)
Time per request:       288.180 [ms] (mean)
Time per request:       2.882 [ms] (mean, across all concurrent requests)
Transfer rate:          286.35 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   26  76.8     11     876
Processing:     5  261 244.7    225    2037
Waiting:        5  259 243.3    223    2033
Total:         13  287 275.4    237    2261
Percentage of the requests served within a certain time (ms)
  50%    237
  66%    340
  75%    437
  80%    485
  90%    569
  95%    635
  98%   1106
  99%   1516
 100%   2261 (longest request)
2020/01/22 15:05:51 Matched stat line [Connect:        0   26  76.8     11     876 Connect 0 26 76.8 11 876]
2020/01/22 15:05:51 Matched stat line [Processing:     5  261 244.7    225    2037 Processing 5 261 244.7 225 2037]
2020/01/22 15:05:51 Matched stat line [Waiting:        5  259 243.3    223    2033 Waiting 5 259 243.3 223 2033]
2020/01/22 15:05:51 Matched stat line [Total:         13  287 275.4    237    2261 Total 13 287 275.4 237 2261]
2020/01/22 15:05:51 Matched percentline [  50%    237 50 237]
2020/01/22 15:05:51 Matched percentline [  66%    340 66 340]
2020/01/22 15:05:51 Matched percentline [  75%    437 75 437]
2020/01/22 15:05:51 Matched percentline [  80%    485 80 485]
2020/01/22 15:05:51 Matched percentline [  90%    569 90 569]
2020/01/22 15:05:51 Matched percentline [  95%    635 95 635]
2020/01/22 15:05:51 Matched percentline [  98%   1106 98 1106]
2020/01/22 15:05:51 Matched percentline [  99%   1516 99 1516]
2020/01/22 15:05:51 Matched percentline [ 100%   2261 100 2261]
{"connect":{"max":876,"mean":26,"median":11,"min":0,"stdDev":76.80000305175781},"percentiles":{"100":2261,"50":237,"66":340,"75":437,"80":485,"90":569,"95":635,"98":1106,"99":1516},"processing":{"max":2037,"mean":261,"median":225,"min":5,"stdDev":244.6999969482422},"total":{"max":2261,"mean":287,"median":237,"min":13,"stdDev":275.3999938964844},"waiting":{"max":2033,"mean":259,"median":223,"min":5,"stdDev":243.3000030517578}}